"""
Конфигурация бота обучения сотрудников "Капучино"
"""

import os

# ─────────────────────────────────────────────────────────────────────────────
# 1. Токен бота — получи у @BotFather в Telegram
# ─────────────────────────────────────────────────────────────────────────────
BOT_TOKEN: str = os.getenv("BOT_TOKEN", "8303682526:AAForxlouGH754b67NvqiKKVDLfF4-nDQWE")

# ─────────────────────────────────────────────────────────────────────────────
# 2. Telegram chat_id руководителя — куда приходят карточки новых сотрудников
#    Узнать свой ID: напиши боту @getmyid_bot
# ─────────────────────────────────────────────────────────────────────────────
ADMIN_CHAT_ID: int = int(os.getenv("ADMIN_CHAT_ID", "1030574919"))

# ─────────────────────────────────────────────────────────────────────────────
# 3. Список подразделений / кафе сети
# ─────────────────────────────────────────────────────────────────────────────
BRANCHES = [
    "Продавец-официант",
    "Менеджер-кондитер",
    "Менеджер зала"
    "Бармен",
    "Управляющий",
]
